Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: وزخرفا وإن كل ذلك لما متاع الحياة الدنيا والآخرة عند ربك للمتقين
en: And adornments of gold. Yet all this (i.e. the roofs, doors, stairs, elevators, thrones of their houses) would have been nothing but an enjoyment of this world. And the Hereafter with your Lord is (only) for the Muttaqun.

source: ومن يعش عن ذكر الرحمن نقيض له شيطانا فهو له قرين
en: And whosoever turns away blindly from the remembrance of the Most Gracious (Allah) (i.e. this Qur'an and worship of Allah), We appoint for him Shaitan (Satan - devil) to be a Qarin (a companion) to him.

source: وإنهم ليصدونهم عن السبيل ويحسبون أنهم مهتدون
en: And verily, they (Satans / devils) hinder them from the Path (of Allah), but they think that they are guided aright!

source: حتى إذا جاءنا قال يا ليت بيني وبينك بعد المشرقين فبئس القرين
en: Till, when (such a one) comes to Us, he says [to his Qarin (Satan / devil companion)] "Would that between me and you were the distance of the two easts (or the east and west)" - a worst (type of) companion (indeed)!

source: ولن ينفعكم اليوم إذ ظلمتم أنكم في العذاب مشتركون
en: It will profit you not this Day (O you who turn away from Allah's remembrance and His worship) as you did wrong, (and) that you will be sharers (you and your Qarin ) in the punishment.

source: أفأنت تسمع الصم أو تهدي العمي ومن كان في ضلال مبين
en: Can you (O Muhammad صلى الله عليه و سلم) make the deaf to hear, or can you guide the blind or him who is in manifest error?

source: فإما نذهبن بك فإنا منهم منتقمون
en: And even if We take you (O Muhammad صلى الله عليه و سلم) away, We shall indeed take vengeance on them.

source: أو نرينك الذي وعدناهم فإنا عليهم مقتدرون
en: Or (if) We show you that wherewith We threaten them: then verily We have perfect command over them.

source: فاستمسك بالذي أوحي إليك إنك على صراط مستقيم
en: So hold you (O Muhammad صلى الله عليه و سلم) fast to that which is revealed to you. Verily you are on the Straight Path.

source: وإنه لذكر لك ولقومك وسوف تسألون
en: And verily this (the Qur'an) is indeed a Reminder for you (O Muhammad صلى الله عليه و سلم) and your people (Quraish people, or your followers), and you will be questioned (about it).

source: واسأل من أرسلنا من قبلك من رسلنا أجعلنا من دون الرحمن آلهة يعبدون
en: And ask (O Muhammad صلى الله عليه و سلم) those of Our Messengers whom We sent before you: "Did We ever appoint alihah (gods) to be worshipped besides the Most Gracious (Allah)?"

source: ولقد أرسلنا موسى بآياتنا إلى فرعون وملئه فقال إني رسول رب العالمين
en: And indeed We did send Musa (Moses) with Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) to Fir'aun (Pharaoh) and his chiefs (inviting them to Allah's religion of Islam) He said: "Verily, I am a Messenger of the Lord of the 'Alamin (mankind, jinn and all that exists)."

source: فلما جاءهم بآياتنا إذا هم منها يضحكون
en: But when he came to them with Our Ayat (proofs, evidence, verses, lessons, signs, revelations) behold, they laughed at them.

source: وما نريهم من آية إلا هي أكبر من أختها وأخذناهم بالعذاب لعلهم يرجعون
en: And not an Ayah (sign, etc.) We showed them but it was greater than its fellow , and We seized them with torment, in order that they might turn [from their polytheism to Allah's religion (Islamic Monotheism)].

source: وقالوا يا أيه الساحر ادع لنا ربك بما عهد عندك إننا لمهتدون
en: And they said [to Musa (Moses)]: "O you sorcerer! Invoke your Lord for us according to what He has covenanted with you. Verily, We shall guide ourselves (aright)."

source: فلما كشفنا عنهم العذاب إذا هم ينكثون
en: But when We removed the torment from them, behold, they broke their covenant (that they will believe if We remove the torment from them).

source: ونادى فرعون في قومه قال يا قوم أليس لي ملك مصر وهذه الأنهار تجري من تحتي أفلا تبصرون
en: And Fir'aun (Pharaoh) proclaimed among his people (saying): "O my people! Is not mine the dominion of Egypt, and these rivers flowing underneath me. See you not then?

source: أم أنا خير من هذا الذي هو مهين ولا يكاد يبين
en: "Am I not better than this one [Musa (Moses)] who is despicable and can scarcely express himself clearly?

source: فلولا ألقي عليه أسورة من ذهب أو جاء معه الملائكة مقترنين
en: "Why then are not golden bracelets bestowed on him, or angels sent along with him?"

source: فاستخف قومه فأطاعوه إنهم كانوا قوما فاسقين
en: Thus he [Fir'aun (Pharaoh)] befooled (and misled) his people, and they obeyed him. Verily, they were ever a people who were Fasiqun (rebellious, disobedient to Allah).

source: فلما آسفونا انتقمنا منهم فأغرقناهم أجمعين
en: So when they angered Us, We punished them, and drowned them all.

source: فجعلناهم سلفا ومثلا للآخرين
en: And We made them a precedent (as a lesson for those coming after them), and an example to later generations.

source: ولما ضرب ابن مريم مثلا إذا قومك منه يصدون
en: And when the son of Maryam (Mary) is quoted as an example [i.e. 'Îsa (Jesus) is worshipped like their idols], behold, your people cry aloud (laugh out at the example).

source: وقالوا أآلهتنا خير أم هو ما ضربوه لك إلا جدلا بل هم قوم خصمون
en: And say: "Are our alihah (gods) better or is he ['Îsa (Jesus)]?" They quoted not the above example except for argument. Nay! But they are a quarrelsome people. (See V. 21:98-101)

source: إن هو إلا عبد أنعمنا عليه وجعلناه مثلا لبني إسرائيل
en: He ['Îsa (Jesus)] was not more than a slave. We granted Our Favour to him, and We made him an example for the Children of Israel (i.e. his creation without a father).

source: ولو نشاء لجعلنا منكم ملائكة في الأرض يخلفون
en: And if it were Our Will, We would have [destroyed you (mankind) all, and] made angels to replace you on the earth. [Tafsir At-Tabari].

source: وإنه لعلم للساعة فلا تمترن بها واتبعون هذا صراط مستقيم
en: And he ['Îsa (Jesus), son of Maryam (Mary)] shall be a known sign for (the coming of) the Hour (Day of Resurrection) [i.e. 'Isa's (Jesus) descent on the earth]. Therefore have no doubt concerning it (i.e. the Day of Resurrection). And follow Me (Allah) (i.e. be obedient to Allah and do what He orders you to do, O mankind)! This is the Straight Path (of Islamic Monotheism, leading to Allah and to His Paradise).

source: ولا يصدنكم الشيطان إنه لكم عدو مبين
en: And let not Shaitan (Satan) hinder you (from the right religion, i.e. Islamic Monotheism). Verily, he (Satan) to you is a plain enemy.

source: ولما جاء عيسى بالبينات قال قد جئتكم بالحكمة ولأبين لكم بعض الذي تختلفون فيه فاتقوا الله وأطيعون
en: And when 'Îsa (Jesus) came with (Our) clear Proofs, he said: "I have come to you with Al-Hikmah (Prophethood), and in order to make clear to you some of the (points) in which you differ. Therefore fear Allah and obey me.

source: إن الله هو ربي وربكم فاعبدوه هذا صراط مستقيم
en: "Verily, Allah! He is my Lord (God) and your Lord (God). So worship Him (Alone). This is the (only) Straight Path (i.e. Allah's religion of true Islamic Monotheism)."

source: فاختلف الأحزاب من بينهم فويل للذين ظلموا من عذاب يوم أليم
en: But the sects from among themselves differed. So woe to those who do wrong [by ascribing things to 'Îsa (Jesus) that are not true] from the torment of a painful Day (i.e. the Day of Resurrection)!

source: هل ينظرون إلا الساعة أن تأتيهم بغتة وهم لا يشعرون
en: Do they only wait for the Hour that it shall come upon them suddenly, while they perceive not?

source: الأخلاء يومئذ بعضهم لبعض عدو إلا المتقين
en: Friends on that Day will be foes one to another except Al-Muttaqun (the pious. See V.2:2).

source: يا عباد لا خوف عليكم اليوم ولا أنتم تحزنون
en: (It will be said to the true believers of Islamic Monotheism): My worshippers! No fear shall be on you this Day, nor shall you grieve,

source: الذين آمنوا بآياتنا وكانوا مسلمين
en: (You) who believed in Our Ayat (proofs, verses, lessons, signs, revelations, etc.) and were Muslims (i.e. who submit totally to Allah's Will, and believe in the Oneness of Allah - Islamic Monotheism).

source: ادخلوا الجنة أنتم وأزواجكم تحبرون
en: Enter Paradise, you and your wives, in happiness.

source: يطاف عليهم بصحاف من ذهب وأكواب وفيها ما تشتهيه الأنفس وتلذ الأعين وأنتم فيها خالدون
en: Trays of gold and cups will be passed round them; (there will be) therein all that inner-selves could desire, and all that eyes could delight in and you will abide therein forever.

source: وتلك الجنة التي أورثتموها بما كنتم تعملون
en: This is the Paradise which you have been made to inherit because of your deeds which you used to do (in the life of the world).

source: لكم فيها فاكهة كثيرة منها تأكلون
en: Therein for you will be fruits in plenty, of which you will eat (as you desire).

source: إن المجرمين في عذاب جهنم خالدون
en: Verily, the Mujrimun (criminals, sinners, disbelievers) will be in the torment of Hell to abide therein forever.

source: لا يفتر عنهم وهم فيه مبلسون
en: (The torment) will not be lightened for them, and they will be plunged into destruction with deep regrets, sorrows and in despair therein.

source: وما ظلمناهم ولكن كانوا هم الظالمين
en: We wronged them not, but they were the Zalimun (polytheists, wrong-doers).

source: ونادوا يا مالك ليقض علينا ربك قال إنكم ماكثون
en: And they will cry: "O Malik (Keeper of Hell)! Let your Lord make an end of us." He will say: "Verily, you shall abide forever."

source: لقد جئناكم بالحق ولكن أكثركم للحق كارهون
en: Indeed We have brought the truth (Muhammad صلى الله عليه و سلم with the Qur'an) to you, but most of you have a hatred for the truth.

source: أم أبرموا أمرا فإنا مبرمون
en: Or have they plotted some plan? Then We too are planning.

source: أم يحسبون أنا لا نسمع سرهم ونجواهم بلى ورسلنا لديهم يكتبون
en: Or do they think that We hear not their secrets and their private counsel? (Yes We do) and Our messengers (appointed angels in charge of mankind) are by them, to record.

source: قل إن كان للرحمن ولد فأنا أول العابدين
en: Say (O Muhammad صلى الله عليه و سلم): "If the Most Gracious (Allah) had a son (or children as you pretend), then I am the first of Allah's worshippers [who deny and refute this claim of yours (and the first to believe in Allah Alone and testify that He has no children)]." [Tafsir At-Tabari].

source: سبحان رب السماوات والأرض رب العرش عما يصفون
en: Glorified be the Lord of the heavens and the earth, the Lord of the Throne! Exalted be He from all that they ascribe (to Him).

source: فذرهم يخوضوا ويلعبوا حتى يلاقوا يومهم الذي يوعدون
en: So leave them (alone) to speak nonsense and play until they meet the Day of theirs which they have been promised.

source: وهو الذي في السماء إله وفي الأرض إله وهو الحكيم العليم
en: It is He (Allah) Who is the only Ilah (God to be worshipped) in the heaven and the only Ilah (God to be worshipped) on the earth. And He be the All-Wise, the All-Knower.

source: وتبارك الذي له ملك السماوات والأرض وما بينهما وعنده علم الساعة وإليه ترجعون
en: And Blessed be He to Whom belongs the kingdom of the heavens and the earth, and all that is between them, and with Whom is the knowledge of the Hour, and to Whom you (all) will be returned.

source: ولا يملك الذين يدعون من دونه الشفاعة إلا من شهد بالحق وهم يعلمون
en: And those whom they invoke instead of Him have no power of intercession - except for those who bear witness to the truth knowingly (i.e. believed in the Oneness of Allah, and obeyed His Orders), and they know (the facts about the Oneness of Allah).

source: ولئن سألتهم من خلقهم ليقولن الله فأنى يؤفكون
en: And if you ask them who created them, they will surely say: "Allah." How then are they turned away (from the worship of Allah, Who created them)?

source: وقيله يا رب إن هؤلاء قوم لا يؤمنون
en: (And Allah has the knowledge) of (Prophet Muhammad's) saying: "O my Lord! Verily, these are a people who believe not!"

source: فاصفح عنهم وقل سلام فسوف يعلمون
en: So turn away from them (O Muhammad صلى الله عليه و سلم), and say: Salam (peace)! But they will come to know.

source: إنا أنزلناه في ليلة مباركة إنا كنا منذرين
en: We sent it (this Qur'an) down on a blessed night [(i.e. night of Al-Qadr, Surah No. 97) in the month of Ramadan - the 9th month of the Islamic calendar]. Verily, We are ever warning [mankind that Our Torment will reach those who disbelieve in Our Oneness of Lordship and in Our Oneness of worship].

source: فيها يفرق كل أمر حكيم
en: Therein (that night) is decreed every matter of ordainments.

source: أمرا من عندنا إنا كنا مرسلين
en: As a Command (or this Qur'an or the Decree of every matter) from Us. Verily, We are ever sending (the Messengers),

source: رحمة من ربك إنه هو السميع العليم
en: (As) a Mercy from your Lord. Verily, He is the All-Hearer, the All-Knower.

source: رب السماوات والأرض وما بينهما إن كنتم موقنين
en: The Lord of the heavens and the earth and all that is between them, if you (but) have a faith with certainty.

source: لا إله إلا هو يحيي ويميت ربكم ورب آبائكم الأولين
en: La ilaha illa Huwa (none has the right to be worshipped but He). It is He Who gives life and causes death - your Lord and the Lord of your forefathers.

source: بل هم في شك يلعبون
en: Nay! They play about in doubt.

source: فارتقب يوم تأتي السماء بدخان مبين
en: Then wait you for the Day when the sky will bring forth a visible smoke,

source: يغشى الناس هذا عذاب أليم
en: Covering the people: this is a painful torment.

source: ربنا اكشف عنا العذاب إنا مؤمنون
en: (They will say): "Our Lord! Remove the torment from us, really we shall become believers!"

source: أنى لهم الذكرى وقد جاءهم رسول مبين
en: How can there be for them an admonition (at the time when the torment has reached them), when a Messenger explaining things clearly has already come to them.

source: ثم تولوا عنه وقالوا معلم مجنون
en: Then they had turned away from him (Messenger Muhammad صلى الله عليه و سلم) and said: (He is) one taught (by a human being), a madman!"

source: إنا كاشفو العذاب قليلا إنكم عائدون
en: Verily, We shall remove the torment for a while. Verily you will revert (to disbelief).

source: يوم نبطش البطشة الكبرى إنا منتقمون
en: On the Day when We shall seize you with the greatest seizure (punishment). Verily, We will exact retribution.

source: ولقد فتنا قبلهم قوم فرعون وجاءهم رسول كريم
en: And indeed We tried before them Fir'aun's (Pharaoh) people, when there came to them a noble Messenger [i.e. Musa (Moses) عليه السلام],

source: أن أدوا إلي عباد الله إني لكم رسول أمين
en: Saying: "Deliver to me the slaves of Allah (i.e. the Children of Israel). Verily, I am to you a Messenger worthy of all trust.

source: وأن لا تعلوا على الله إني آتيكم بسلطان مبين
en: "And exalt not yourselves against Allah. Truly, I have come to you with a manifest authority.

source: وإني عذت بربي وربكم أن ترجمون
en: "And truly, I seek refuge with my Lord and your Lord, lest you should stone me (or call me a sorcerer or kill me).

source: وإن لم تؤمنوا لي فاعتزلون
en: "But if you believe me not, then keep away from me and leave me alone."

source: فدعا ربه أن هؤلاء قوم مجرمون
en: (But they were aggressive), so he [Musa (Moses)] called upon his Lord (saying): "These are indeed the people who are Mujrimun (disbelievers, polytheists, sinners, criminals)."

source: فأسر بعبادي ليلا إنكم متبعون
en: (Allah said): "Depart you with My slaves by night. Surely, you will be pursued.

source: واترك البحر رهوا إنهم جند مغرقون
en: "And leave the sea as it is (quiet and divided). Verily, they are a host to be drowned."

source: كم تركوا من جنات وعيون
en: How many of gardens and springs that they [Fir'aun's (Pharaoh) people] left behind,

source: وزروع ومقام كريم
en: And green crops (fields) and goodly places,

source: ونعمة كانوا فيها فاكهين
en: And comforts of life wherein they used to take delight!

source: كذلك وأورثناها قوما آخرين
en: Thus (it was)! And We made other people inherit them (i.e. We made the Children of Israel to inherit the kingdom of Egypt).

source: فما بكت عليهم السماء والأرض وما كانوا منظرين
en: And the heavens and the earth wept not for them, nor were they given a respite.

source: ولقد نجينا بني إسرائيل من العذاب المهين
en: And indeed We saved the Children of Israel from the humiliating torment:

source: من فرعون إنه كان عاليا من المسرفين
en: From Fir'aun (Pharaoh); verily he was arrogant and was of the Musrifun (those who transgress beyond bound in spending and other things and commit great sins).

source: ولقد اخترناهم على علم على العالمين
en: And We chose them (the Children of Israel) above the 'Alamin (mankind and jinn) [during the time of Musa (Moses)] with knowledge,

source: وآتيناهم من الآيات ما فيه بلاء مبين
en: And granted them signs in which there was a plain trial.

source: إن هؤلاء ليقولون
en: Verily, these (Quraish) people are saying:

source: إن هي إلا موتتنا الأولى وما نحن بمنشرين
en: "There is nothing but our first death, and we shall not be resurrected.

source: فأتوا بآبائنا إن كنتم صادقين
en: "Then bring back our forefathers, if you speak the truth!"

source: أهم خير أم قوم تبع والذين من قبلهم أهلكناهم إنهم كانوا مجرمين
en: Are they better or the people of Tubba' and those before them? We destroyed them because they were indeed Mujrimun (disbelievers, polytheists, sinners, criminals).

source: وما خلقنا السماوات والأرض وما بينهما لاعبين
en: And We created not the heavens and the earth, and all that is between them, for mere play.

source: ما خلقناهما إلا بالحق ولكن أكثرهم لا يعلمون
en: We created them not except with truth (i.e. to examine and test those who are obedient and those who are disobedient and then reward the obedient ones and punish the disobedient ones), but most of them know not.

source: إن يوم الفصل ميقاتهم أجمعين
en: Verily, the Day of Judgement (when Allah will judge between the creatures) is the time appointed for all of them -

source: يوم لا يغني مولى عن مولى شيئا ولا هم ينصرون
en: The Day when a Maula (a near relative) cannot avail a Maula (a near relative) in aught, and no help can they receive,

source: إلا من رحم الله إنه هو العزيز الرحيم
en: Except him on whom Allah has Mercy. Verily, He is the All-Mighty, the Most Merciful.

source: إن شجرت الزقوم
en: Verily, the tree of Zaqqum

source: طعام الأثيم
en: Will be the food of the sinners.

source: كالمهل يغلي في البطون
en: Like boiling oil, it will boil in the bellies,

source: كغلي الحميم
en: Like the boiling of scalding water.

source: خذوه فاعتلوه إلى سواء الجحيم
en: (It will be said) "Seize him and drag him into the midst of blazing Fire,

source: ثم صبوا فوق رأسه من عذاب الحميم
en: "Then pour over his head the torment of boiling water.

source: ذق إنك أنت العزيز الكريم
en: "Taste you (this)! Verily, you were (pretending to be) the mighty, the generous!

source: إن هذا ما كنتم به تمترون
en: "Verily, this is that whereof you used to doubt!"

source: إن المتقين في مقام أمين
en: Verily, the Muttaqun (the pious. See V.2:2), will be in place of Security (Paradise).

source: يلبسون من سندس وإستبرق متقابلين
en: Dressed in fine silk and (also) in thick silk, facing each other,

source: كذلك وزوجناهم بحور عين
en: So (it will be). And We shall marry them to Hur (fair female) with wide, lovely eyes.

source: يدعون فيها بكل فاكهة آمنين
en: They will call therein for every kind of fruit in peace and security;

source: لا يذوقون فيها الموت إلا الموتة الأولى ووقاهم عذاب الجحيم
en: They will never taste death therein except the first death (of this world), and He will save them from the torment of the blazing Fire,

source: فضلا من ربك ذلك هو الفوز العظيم
en: As a Bounty from your Lord! That will be the supreme success!

source: فإنما يسرناه بلسانك لعلهم يتذكرون
en: Certainly, We have made this (Qur'an) easy in your tongue, in order that they may remember.

source: فارتقب إنهم مرتقبون
en: Wait then (O Muhammad صلى الله عليه و سلم); verily, they (too) are waiting.

source: إن في السماوات والأرض لآيات للمؤمنين
en: Verily, in the heavens and the earth are signs for the believers.

source: وفي خلقكم وما يبث من دابة آيات لقوم يوقنون
en: And in your creation, and what He scattered (through the earth) of moving (living) creatures are signs for people who have Faith with certainty.

source: واختلاف الليل والنهار وما أنزل الله من السماء من رزق فأحيا به الأرض بعد موتها وتصريف الرياح آيات لقوم يعقلون
en: And in the alternation of night and day, and the provision (rain) that Allah sends down from the sky, and revives therewith the earth after its death, and in the turning about of the winds (i.e. sometimes towards the east or north, and sometimes towards the south or west sometimes bringing glad tidings of rain etc., and sometimes bringing the torment), are signs for a people who understand.

source: تلك آيات الله نتلوها عليك بالحق فبأي حديث بعد الله وآياته يؤمنون
en: These are the Ayat (proofs, evidence, verses, lessons, revelations, etc.) of Allah, which We recite to you (O Muhammad صلى الله عليه و سلم) with truth. Then in which speech after Allah and His Ayat will they believe?

source: ويل لكل أفاك أثيم
en: Woe to every sinful liar

source: يسمع آيات الله تتلى عليه ثم يصر مستكبرا كأن لم يسمعها فبشره بعذاب أليم
en: Who hears the Verses of Allah (being) recited to him, yet persists with pride as if he heard them not. So announce to him a painful torment!

source: وإذا علم من آياتنا شيئا اتخذها هزوا أولئك لهم عذاب مهين
en: And when he learns something of Our Verses (this Qur'an), he makes them a jest. For such there will be a humiliating torment.

source: من ورائهم جهنم ولا يغني عنهم ما كسبوا شيئا ولا ما اتخذوا من دون الله أولياء ولهم عذاب عظيم
en: In front of them there is Hell. And that which they have earned will be of no profit to them, nor (will be of any profit to them) those whom they have taken as Auliya' (protectors, helpers) besides Allah. And theirs will be a great torment.

source: هذا هدى والذين كفروا بآيات ربهم لهم عذاب من رجز أليم
en: This (Qur'an) is a guidance. And those who disbelieve in the Ayat (proofs, evidence, verses, lessons, signs, revelations) of their Lord, for them there is a painful torment of Rijz (a severe kind of punishment).

source: الله الذي سخر لكم البحر لتجري الفلك فيه بأمره ولتبتغوا من فضله ولعلكم تشكرون
en: Allah, it is He Who has subjected to you the sea, that ships may sail through it by His Command, and that you may seek of His Bounty, and that you may be thankful.

source: وسخر لكم ما في السماوات وما في الأرض جميعا منه إن في ذلك لآيات لقوم يتفكرون
en: And has subjected to you all that is in the heavens and all that is in the earth; it is all as a favour and kindness from Him. Verily, in it are signs for a people who think deeply.

source: قل للذين آمنوا يغفروا للذين لا يرجون أيام الله ليجزي قوما بما كانوا يكسبون
en: Say (O Muhammad صلى الله عليه و سلم) to the believers to forgive those who (harm them and) hope not for the Days of Allah (i.e. His Recompense), that He may recompense people, according to what they have earned (i.e. to punish these disbelievers who harm the believers).

source: من عمل صالحا فلنفسه ومن أساء فعليها ثم إلى ربكم ترجعون
en: Whosoever does a good deed, it is for his ownself, and whosoever does evil, it is against (his ownself). Then to your Lord you will be made to return.

source: ولقد آتينا بني إسرائيل الكتاب والحكم والنبوة ورزقناهم من الطيبات وفضلناهم على العالمين
en: And indeed We gave the Children of Israel the Scripture, and the understanding of the Scripture and its laws, and the Prophethood; and provided them with good things, and preferred them above the 'Alamin (mankind and jinn of their time, during that period),

source: وآتيناهم بينات من الأمر فما اختلفوا إلا من بعد ما جاءهم العلم بغيا بينهم إن ربك يقضي بينهم يوم القيامة فيما كانوا فيه يختلفون
en: And gave them clear proofs in matters [by revealing to them the Taurat (Torah)]. And they differed not until after the knowledge came to them, through envy among themselves. Verily, Your Lord will judge between them on the Day of Resurrection about that wherein they used to differ.
